dongdong-2009/project_zynq7000/rt-thread/bsp/stm32f7-disco/MotorControl/src/stm32f7xx_tacho.c
}


/*******************************************************************************
* ROUTINE Name : TAC_InitTachoMeasure
*
* Description : Clear software FIFO where are "pushed" latest speed informations
*           This function must be called before starting the motor to initialize
*	    the speed measurement process.
*
* Input       : None
* Output      : None
* Return      : None
* Note        : First measurements following this function call will be done
*               without filtering (no rolling average).
*******************************************************************************/
void TAC_InitTachoMeasure( void )
{
   // Mask interrupts to insure a clean intialization
   
   TIM_ITConfig(TACHO_TIMER, TIM_IT_CC, DISABLE);
   
  
   RatioDec = FALSE;
   RatioInc = FALSE;
   DoRollingAverage = FALSE;
   InitRollingAverage = FALSE;
   TachoTimeOut = FALSE;

   hCaptCounter = 0;
   bGP1_OVF_Counter = 0;

   for (bSpeedFIFO_Index=0; bSpeedFIFO_Index < SPEED_FIFO_SIZE; bSpeedFIFO_Index++)
   {
      SensorPeriod[bSpeedFIFO_Index].hCapture = U16_MAX;
      SensorPeriod[bSpeedFIFO_Index].hPrscReg = MAX_RATIO;
   }

   // First measurement will be stored in the 1st array location
   bSpeedFIFO_Index = SPEED_FIFO_SIZE-1;

   // Re-initialize partly the timer
   TACHO_TIMER->PSC = MAX_RATIO;
   
   // TIM_ResetCounter(TACHO_TIMER);
   TACHO_TIMER->CNT = TACHO_COUNTER_RESET;
   
   TIM_Cmd(TACHO_TIMER, ENABLE);
   
   TIM_ITConfig(TACHO_TIMER, TIM_IT_CC, ENABLE);

}


/*******************************************************************************
* ROUTINE Name : TAC_GetRotorFreqInHz
*
* Description : This routine returns Rotor frequency with [0.1Hz] definition.
*		Result is given by the following formula:
*		Frotor = K x (Fosc / (Capture x number of overflow)))
*		where K depends on the number of motor and tacho poles pairs
*
* Input    : None
* Output   : None
* Returns  : Rotor mechanical frequency, with 0.1Hz resolution.
* Comments : Result is zero if speed is too low (glitches at start for instance)
*           Excessive speed (or high freq glitches will result in a pre-defined
*           value returned.
* Warning : Maximum expectable accuracy depends on CKTIM: 72MHz will give the
* 	    best results.
*******************************************************************************/
u16 TAC_GetRotorFreqInHz ( void )
{
   u32 wFreqBuffer;
   u16 hRotorFreq;

   if ( DoRollingAverage)
   {
      wFreqBuffer = GetAvrgTachoPeriod();
   }
   else
   {  // Raw tacho period
      wFreqBuffer = GetLastTachoPeriod();
   }

   if (TachoTimeOut == TRUE)
   {
      hRotorFreq = 0;
   }
   else
   {
      if ( TACHO_TIMER->PSC >= MAX_RATIO ) /* At start-up or very low freq */
      {                           /* Based on current prescaler value only */
         hRotorFreq = 0;
      }
      else
      {
         if( wFreqBuffer > MAX_PERIOD) /* Speed is too low */
         {
            hRotorFreq = 0;
         }
         else
         {
            if ( wFreqBuffer <= (u32)SPEED_OVERFLOW ) /*Avoid u32 DIV Overflow*/
            {
               hRotorFreq = MAX_SPEED;
            }
            else
            {
               hRotorFreq = (u16) ( ROTOR_SPEED_FACTOR / wFreqBuffer );
            }
         }
      }
   }

   return (hRotorFreq);
}


/*******************************************************************************
* ROUTINE Name : TAC_GetRotorFreq
*
* Description : This routine returns Rotor frequency with an unit that can be
*               directly integrated t oget the speed in the main control loop.
*
* Input    : None
* Output   : None
* Returns  : Rotor mechanical frequency with rad/PWM period unit
*             (here 2*PI rad = 0xFFFF).
* Comments : Result is zero if speed is too low (glitches at start for instance)
*           Excessive speed (or high freq glitches will result in a pre-defined
*           value returned.
* Warning : Maximum expectable accuracy depends on CKTIM: 60MHz will give the
* 	    best results.
*******************************************************************************/
u16 TAC_GetRotorFreq ( void )
{
   u32 wFreqBuffer;
   u16 hRotorFreq;

   if ( DoRollingAverage)
   {
      wFreqBuffer = GetAvrgTachoPeriod();
   }
   else
   {  // Raw tacho period
      wFreqBuffer = GetLastTachoPeriod();
   }

   if (TachoTimeOut == TRUE)
   {
      hRotorFreq = 0;
   }
   else
   {
      if ( TACHO_TIMER->PSC >= MAX_RATIO ) /* At start-up or very low freq */
      {                           /* Based on current prescaler value only */
         hRotorFreq = 0;
      }
      else
      {
         if( wFreqBuffer > MAX_PERIOD) /* Speed is too low */
         {
            hRotorFreq = 0;
         }
         else
         {
            if ( wFreqBuffer <= (u32)SPEED_OVERFLOW )/*Avoid u32 DIV Overflow*/
            {
               hRotorFreq = MAX_PSEUDO_SPEED;
            }
            else
            {
               hRotorFreq = ((u16) (PSEUDO_FREQ_CONV / wFreqBuffer) );
            }
         }
      }
   }

   return (hRotorFreq);
}


/*******************************************************************************
* ROUTINE Name : TAC_ClrTimeOut
*
* Description     : Clears the flag indicating that that informations are lost,
*                   or speed is decreasing sharply.
* Input           : None
* Output          : Clear TachoTimeOut
* Return          : None
*******************************************************************************/
void TAC_ClrTimeOut(void)
{
   TachoTimeOut = FALSE;
}


/*******************************************************************************
* ROUTINE Name : TAC_IsTimedOut
*
* Description     : Indicates to the upper layer SW that tacho informations
*                   disappeared (for a while at least).
* Input           : None
* Output          : None
* Return          : boolean, TRUE in case of Time Out
* Note            : The time-out duration depends on tacho timer pre-scaler,
*                   which is variable; the time-out will be higher at low speed.
*******************************************************************************/
bool TAC_IsTimedOut(void)
{
   return(TachoTimeOut);
}


