dongdong-2009/project_zynq7000/rt-thread/bsp/stm32f7-disco/MotorControl/src/stm32f7xx_tacho.c
/*******************************************************************************
* ROUTINE Name : TAC_GetCaptCounter
*
* Description     : Gives the number of tacho capture interrupts since last call
*                   of the TAC_ClrCaptCounter function.
* Input           : None
* Output          : None
* Return          : u16 integer (Roll-over is prevented in the tacho capture
*                   routine itself).
*******************************************************************************/
u16 TAC_GetCaptCounter(void)
{
   return(hCaptCounter);
}


/*******************************************************************************
* ROUTINE Name : TAC_ClrCaptCounter
*
* Description     : Clears the variable holding the number of capture events.
* Input           : None
* Output          : hCaptCounter is cleared.
* Return          : None
*******************************************************************************/
void TAC_ClrCaptCounter(void)
{
   hCaptCounter = 0;
}


/*******************************************************************************
* ROUTINE Name : GetLastTachoPeriod
*
* Description     : returns the rotor pseudo-period based on last tacho capture
* Input           : None
* Output          : None
* Return          : rotor pseudo-period, as a number of CKTIM periods
*******************************************************************************/
u32 GetLastTachoPeriod(void)
{
      u32 wFreqBuffer;
      u8 bLastSpeedFIFO_Index;

   // Store current index to prevent errors if Capture occurs during processing
   bLastSpeedFIFO_Index = bSpeedFIFO_Index;

   // This is done assuming interval between captures is higher than time
   // to read the two values
   wFreqBuffer = SensorPeriod[bLastSpeedFIFO_Index].hCapture;
   wFreqBuffer *= (SensorPeriod[bLastSpeedFIFO_Index].hPrscReg + 1);

   return (wFreqBuffer);
}


/*******************************************************************************
* ROUTINE Name : GetAvrgTachoPeriod
*
* Description    : returns the rotor pseudo-period based on 4 last tacho capture
* Input          : None
* Output         : None
* Return         : averaged rotor pseudo-period, as a number of CKTIM periods
* Side effect: the very last tacho period acquired may not be considered for the
* calculation if a capture occurs during averaging.
*******************************************************************************/
u32 GetAvrgTachoPeriod(void)
{
    u32 wFreqBuffer, wAvrgBuffer, wIndex;

  wAvrgBuffer = 0;

  for ( wIndex = 0; wIndex < SPEED_FIFO_SIZE; wIndex++ )
  {
     // Disable capture interrupts to have presc and capture of the same period
     
     TACHO_TIMER->DIER &= ~TIM_IT_CC;     // NB:Std libray not used for perf issues
     
     wFreqBuffer = SensorPeriod[wIndex].hCapture;
     wFreqBuffer *= (SensorPeriod[wIndex].hPrscReg + 1);
     
     TACHO_TIMER->DIER |= TIM_IT_CC;     // NB:Std libray not used for perf issues
     
     wAvrgBuffer += wFreqBuffer;	// Sum the whole tacho period FIFO
  }
  wAvrgBuffer += (SPEED_FIFO_SIZE/2)-1;  // Round to upper value
  wAvrgBuffer /= SPEED_FIFO_SIZE;        // Average value	
  return (wAvrgBuffer);
}


/*******************************************************************************
* ROUTINE Name : TAC_StartTachoFiltering
*
* Description : Set the flags to initiate tacho values smoothing mechanism.
* Input       : None
* Output      : The result of the next capture will be copied in the whole array
*               to have 1st average = last value.
* Return      : None
* Note: The initialization of the FIFO used to do the averaging will be done
*       when the next tacho capture interrupt will occur.
*******************************************************************************/
void TAC_StartTachoFiltering( void )
{
   InitRollingAverage = TRUE;
}


/*******************************************************************************
* ROUTINE Name : TAC_ValidSpeedInfo
*
* Description : Used in Start function to know if rotor shaft turns at the right
*               speed.
*
* Input       : Rotor frequency (0.1Hz resolution) above which speed information
*               is not considered reliable (tacho signal too weak).
* Output      : None
* Return      : Boolean, TRUE if tacho provides clean signals.
*
* Warning : Since there's no way to differentiate rotation direction with a
*           tachogenerator, user must be aware that this routine may return TRUE
*           in certain conditions (re-start with no/very short stop time before
*           and high inertia load), even if motor is not started in the right
*           condition. User should therefore manage a minimal amout of time
*           before re-starting.
*           NB: this function may be unefficient if start-up duration is far
*           shorter than time needed to have at least two consecutive speed info
*******************************************************************************/
bool TAC_ValidSpeedInfo( u16 hMinRotorFreq )
{
      bool IsValid;

   TachoTimeOut = FALSE;  // Time-out flag is not significant during start-up

   if ( hMinRotorFreq == 0 ) // Error
   {
      IsValid = FALSE;
   }
   else			// Right start conditions in closed loop:
   {
      if (TAC_GetRotorFreqInHz() > hMinRotorFreq)
      {
         // Decreasing tacho period means accelerating motor
         if (GetAvrgTachoPeriod() >= GetLastTachoPeriod())
         {
            IsValid = TRUE;
         }
         else
         {
            IsValid = FALSE;
         }
      }
      else
      {
         IsValid = FALSE;
      }
   }
   return (IsValid);
}

#ifdef TACHO

/*******************************************************************************
* Function Name  : TIMx_IRQHandler
* Description    : This function handles both the capture event and Update event 
*                  interrupt handling the tacho signal period measurement.
*                  
*                  - On 'CAPTURE' event case:
*                    If the average is initialized, the last captured measure is
*                    copied into the whole array.
*                    Period captures are managed as following:
*                    If too low, the clock prescaler is decreased for next measure
*                    If too high (ie there was overflows), the result is
*                    re-computed as if there was no overflow and the prescaler is
*                    increased to avoid overflows during the next capture
*                   
*                  - On 'UPDATE' event case:
*                    This function handles the overflow of the timer handling
*                    the tacho signal period measurement.
* Input          : 
*                  - On 'CAPTURE' event case:
*                    None
*                   
*                  - On 'UPDATE' event case: 
*                    None
*
* Output         : 
*                  - On 'CAPTURE' event case:
*                   Updates the array holding the 4 latest period measures, reset
*                   the overflow counter and update the clock prescaler to
*                   optimize the accuracy of the measurement.
*                   
*                  - On 'UPDATE' event case:
*                    Updates a Counter of overflows, handled and reset when next
*                    capture occurs. 
*
* Return         : None (Interrupt Service routine)
*******************************************************************************/
#if defined(TIMER2_HANDLES_TACHO)
void TIM2_IRQHandler(void)
#elif defined(TIMER3_HANDLES_TACHO)
void TIM3_IRQHandler(void)
#else // TIMER4_HANDLES_TACHO
void TIM4_IRQHandler(void)
#endif

{
// Check for the source of TIMx int - Capture or Update Event - 
if ( TIM_GetFlagStatus(TACHO_TIMER, TIM_FLAG_Update) == RESET )
{

   // A capture event occured for this interrupt request generation
  #if defined(TACHO_INPUT_TI1)
    TIM_ClearFlag(TACHO_TIMER, TIM_FLAG_CC1);
  #elif defined(TACHO_INPUT_TI2)
    TIM_ClearFlag(TACHO_TIMER, TIM_FLAG_CC2);
  #endif   

   if (hCaptCounter < U16_MAX)
   {
      hCaptCounter++;
   }

   // Compute new array index
   if (bSpeedFIFO_Index < SPEED_FIFO_SIZE-1)
   {
      bSpeedFIFO_Index++;
   }
   else
   {
      bSpeedFIFO_Index = 0;
   }

   // Store the latest speed acquisition
   if (bGP1_OVF_Counter != 0)	// There was counter overflow before capture
   {
        u32 wCaptBuf;
        u16 hPrscBuf;

      #if defined(TACHO_INPUT_TI1)
        wCaptBuf = (u32)TIM_GetCapture1(TACHO_TIMER);
      #elif defined(TACHO_INPUT_TI2)
        wCaptBuf = (u32)TIM_GetGetCapture2(TACHO_TIMER);
      #endif
      
      hPrscBuf = TACHO_TIMER->PSC;

