dongdong-2009/project_zynq7000/rt-thread/bsp/stm32f7-disco/MotorControl/src/stm32f7xx_tacho.c
      while (bGP1_OVF_Counter != 0)
      {
         wCaptBuf += 0x10000uL;// Compute the real captured value (> 16-bit)
         bGP1_OVF_Counter--;
         // OVF Counter is 8-bit and Capt is 16-bit, thus max CaptBuf is 24-bits
      }
      while(wCaptBuf > U16_MAX)
      {
         wCaptBuf /= 2;		// Make it fit 16-bit using virtual prescaler
         // Reduced resolution not a problem since result just slightly < 16-bit
         hPrscBuf = (hPrscBuf * 2) + 1;
         if (hPrscBuf > U16_MAX/2) // Avoid Prsc overflow
         {
            hPrscBuf = U16_MAX;
            wCaptBuf = U16_MAX;
         }
      }
      SensorPeriod[bSpeedFIFO_Index].hCapture = wCaptBuf;
      SensorPeriod[bSpeedFIFO_Index].hPrscReg = hPrscBuf;
      if (RatioInc)
      {
         RatioInc = FALSE;	// Previous capture caused overflow
         // Don't change prescaler (delay due to preload/update mechanism)
      }
      else
      {
         if ((TACHO_TIMER->PSC) < MAX_RATIO) // Avoid OVF w/ very low freq
         {
            (TACHO_TIMER->PSC)++; // To avoid OVF during speed decrease
            RatioInc = TRUE;	  // new prsc value updated at next capture only
         }
      }
   }
   else		// No counter overflow
   {
        u16 hHighSpeedCapture, hClockPrescaler;

      // Read period since last tacho edge
      
      #if defined(TACHO_INPUT_TI1)
        hHighSpeedCapture = (u32)TIM_GetCapture1(TACHO_TIMER);
        
      #elif defined(TACHO_INPUT_TI2)
        hHighSpeedCapture = (u32)TIM_GetGetCapture2(TACHO_TIMER);
      #endif
        
      SensorPeriod[bSpeedFIFO_Index].hCapture = hHighSpeedCapture;
      // Store prescaler directly or incremented if value changed on last capt
      hClockPrescaler = TACHO_TIMER->PSC;

      // If prsc preload reduced in last capture, store current register + 1
      if (RatioDec)  // and don't decrease it again
      {
         SensorPeriod[bSpeedFIFO_Index].hPrscReg = (hClockPrescaler)+1;
         RatioDec = FALSE;
      }
      else  // If prescaler was not modified on previous capture
      {
         if (hHighSpeedCapture >= LOW_RES_THRESHOLD)// If capture range correct
         {
            SensorPeriod[bSpeedFIFO_Index].hPrscReg = hClockPrescaler;
         }
         else
         {
            if(TACHO_TIMER->PSC == 0) // or prescaler cannot be further reduced
            {
               SensorPeriod[bSpeedFIFO_Index].hPrscReg = hClockPrescaler;
            }
            else  // The prescaler needs to be modified to optimize the accuracy
            {
               SensorPeriod[bSpeedFIFO_Index].hPrscReg = hClockPrescaler;
               (TACHO_TIMER->PSC)--;	// Increase accuracy by decreasing prsc
               // Avoid decrementing again in next capt.(register preload delay)
               RatioDec = TRUE;
            }
         }
      }
   }

   if (InitRollingAverage)
   {
        u16 hCaptBuf, hPrscBuf;
        u32 wIndex;
      // Read last captured value and copy it into the whole array
      hCaptBuf = SensorPeriod[bSpeedFIFO_Index].hCapture;
      hPrscBuf = SensorPeriod[bSpeedFIFO_Index].hPrscReg;
      for (wIndex = 0; wIndex<SPEED_FIFO_SIZE-1; wIndex++)
      {
         SensorPeriod[wIndex].hCapture = hCaptBuf;
         SensorPeriod[wIndex].hPrscReg = hPrscBuf;
      }
      InitRollingAverage = FALSE;
      // Starting from now, the values returned by MTC_GetRotorFreq are averaged
      DoRollingAverage = TRUE;
  }
}
else // an update event occured for this interrupt request generation
{
  TIM_ClearFlag(TIM2, TIM_FLAG_Update);

  if (bGP1_OVF_Counter < U8_MAX)
  {
     bGP1_OVF_Counter++;
  }

  if (bGP1_OVF_Counter >= MAX_OVERFLOWS)
  {
     TachoTimeOut = TRUE;
  }
}
}


#endif // TACHO defined
#endif
/******************* (C) COPYRIGHT 2007 STMicroelectronics *****END OF FILE****/
